In [23]:
import sqlite3
import pandas as pd
import numpy as np

Data was taken from this source
https://www.sqltutorial.org/sql-sample-database/
https://www.sqltutorial.org/wp-content/uploads/2020/04/mysql-data.txt

# Create SQL database

In [17]:
## Create new SQL database
conn = sqlite3.connect('departments_2')
cur = conn.cursor()

conn.commit()

In [18]:
# Create SQL table called "departments" 
cur.execute("""CREATE TABLE departments (
                                department_id TEXT PRIMARY KEY NOT NULL,
                                department_name TEXT,
                                location_id TEXT)
            """)
conn.commit()

In [19]:
# Create SQL table called "employees" 
cur.execute("""CREATE TABLE employees (
                                employee_id TEXT PRIMARY KEY NOT NULL,
                                first_name TEXT,
                                last_name TEXT,
                                email TEXT,
                                phone_number TEXT,
                                hire_date NUMERIC,
                                job_id TEXT,
                                salary NUMERIC,
                                manager_id TEXT,
                                department_id TEXT)
            """)
conn.commit()

# Add data to tables

In [20]:
# data to be inserted into "departments" table
add_departments = [
        (1,'Administration',1700),
        (2,'Marketing',1800),
        (3,'Purchasing',1700),
        (4,'Human Resources',2400),
        (5,'Shipping',1500),
        (6,'IT',1400),
        (7,'Public Relations',2700),
        (8,'Sales',2500),
        (9,'Executive',1700),
        (10,'Finance',1700),
        (11,'Accounting',1700)
]

In [21]:
# Insert data into SQL table "departments" 
cur.executemany("""INSERT INTO departments(department_id,department_name,location_id) VALUES (?,?,?)
        """, add_departments)
conn.commit()

In [26]:
# data to be inserted into "employees" table
add_employees = [    
(100,'Steven','King','steven.king@sqltutorial.org','515.123.4567','1987-06-17',4,24000.00,None,9),
(101,'Neena','Kochhar','neena.kochhar@sqltutorial.org','515.123.4568','1989-09-21',5,17000.00,100,9),
(102,'Lex','De Haan','lex.de haan@sqltutorial.org','515.123.4569','1993-01-13',5,17000.00,100,9),
(103,'Alexander','Hunold','alexander.hunold@sqltutorial.org','590.423.4567','1990-01-03',9,9000.00,102,6),
(104,'Bruce','Ernst','bruce.ernst@sqltutorial.org','590.423.4568','1991-05-21',9,6000.00,103,6),
(105,'David','Austin','david.austin@sqltutorial.org','590.423.4569','1997-06-25',9,4800.00,103,6),
(106,'Valli','Pataballa','valli.pataballa@sqltutorial.org','590.423.4560','1998-02-05',9,4800.00,103,6),
(107,'Diana','Lorentz','diana.lorentz@sqltutorial.org','590.423.5567','1999-02-07',9,4200.00,103,6),
(108,'Nancy','Greenberg','nancy.greenberg@sqltutorial.org','515.124.4569','1994-08-17',7,12000.00,101,10),
(109,'Daniel','Faviet','daniel.faviet@sqltutorial.org','515.124.4169','1994-08-16',6,9000.00,108,10),
(110,'John','Chen','john.chen@sqltutorial.org','515.124.4269','1997-09-28',6,8200.00,108,10),
(111,'Ismael','Sciarra','ismael.sciarra@sqltutorial.org','515.124.4369','1997-09-30',6,7700.00,108,10),
(112,'Jose Manuel','Urman','jose manuel.urman@sqltutorial.org','515.124.4469','1998-03-07',6,7800.00,108,10),
(113,'Luis','Popp','luis.popp@sqltutorial.org','515.124.4567','1999-12-07',6,6900.00,108,10),
(114,'Den','Raphaely','den.raphaely@sqltutorial.org','515.127.4561','1994-12-07',14,11000.00,100,3),
(115,'Alexander','Khoo','alexander.khoo@sqltutorial.org','515.127.4562','1995-05-18',13,3100.00,114,3),
(116,'Shelli','Baida','shelli.baida@sqltutorial.org','515.127.4563','1997-12-24',13,2900.00,114,3),
(117,'Sigal','Tobias','sigal.tobias@sqltutorial.org','515.127.4564','1997-07-24',13,2800.00,114,3),
(118,'Guy','Himuro','guy.himuro@sqltutorial.org','515.127.4565','1998-11-15',13,2600.00,114,3),
(119,'Karen','Colmenares','karen.colmenares@sqltutorial.org','515.127.4566','1999-08-10',13,2500.00,114,3),
(120,'Matthew','Weiss','matthew.weiss@sqltutorial.org','650.123.1234','1996-07-18',19,8000.00,100,5),
(121,'Adam','Fripp','adam.fripp@sqltutorial.org','650.123.2234','1997-04-10',19,8200.00,100,5),
(122,'Payam','Kaufling','payam.kaufling@sqltutorial.org','650.123.3234','1995-05-01',19,7900.00,100,5),
(123,'Shanta','Vollman','shanta.vollman@sqltutorial.org','650.123.4234','1997-10-10',19,6500.00,100,5),
(126,'Irene','Mikkilineni','irene.mikkilineni@sqltutorial.org','650.124.1224','1998-09-28',18,2700.00,120,5),
(145,'John','Russell','john.russell@sqltutorial.org',None,'1996-10-01',15,14000.00,100,8),
(146,'Karen','Partners','karen.partners@sqltutorial.org',None,'1997-01-05',15,13500.00,100,8),
(176,'Jonathon','Taylor','jonathon.taylor@sqltutorial.org',None,'1998-03-24',16,8600.00,100,8),
(177,'Jack','Livingston','jack.livingston@sqltutorial.org',None,'1998-04-23',16,8400.00,100,8),
(178,'Kimberely','Grant','kimberely.grant@sqltutorial.org',None,'1999-05-24',16,7000.00,100,8),
(179,'Charles','Johnson','charles.johnson@sqltutorial.org',None,'2000-01-04',16,6200.00,100,8),
(192,'Sarah','Bell','sarah.bell@sqltutorial.org','650.501.1876','1996-02-04',17,4000.00,123,5),
(193,'Britney','Everett','britney.everett@sqltutorial.org','650.501.2876','1997-03-03',17,3900.00,123,5),
(200,'Jennifer','Whalen','jennifer.whalen@sqltutorial.org','515.123.4444','1987-09-17',3,4400.00,101,1),
(201,'Michael','Hartstein','michael.hartstein@sqltutorial.org','515.123.5555','1996-02-17',10,13000.00,100,2),
(202,'Pat','Fay','pat.fay@sqltutorial.org','603.123.6666','1997-08-17',11,6000.00,201,2),
(203,'Susan','Mavris','susan.mavris@sqltutorial.org','515.123.7777','1994-06-07',8,6500.00,101,4),
(204,'Hermann','Baer','hermann.baer@sqltutorial.org','515.123.8888','1994-06-07',12,10000.00,101,7),
(205,'Shelley','Higgins','shelley.higgins@sqltutorial.org','515.123.8080','1994-06-07',2,12000.00,101,11),
(206,'William','Gietz','william.gietz@sqltutorial.org','515.123.8181','1994-06-07',1,8300.00,205,11)
]

In [27]:
# Insert data into SQL table "employees" 
cur.executemany("""INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,
        job_id,salary,manager_id,department_id) VALUES (?,?,?,?,?,?,?,?,?,?)
        """, add_employees)
conn.commit()

# Pull in data into the python environment

In [28]:
cur.execute("SELECT * from departments")
departments_data = pd.DataFrame(cur.fetchall())

In [29]:
departments_data

     0                 1     2
0    1    Administration  1700
1    2         Marketing  1800
2    3        Purchasing  1700
3    4   Human Resources  2400
4    5          Shipping  1500
5    6                IT  1400
6    7  Public Relations  2700
7    8             Sales  2500
8    9         Executive  1700
9   10           Finance  1700
10  11        Accounting  1700

In [30]:
departments_data.columns = [x[0] for x in cur.description]
departments_data

   department_id   department_name location_id
0              1    Administration        1700
1              2         Marketing        1800
2              3        Purchasing        1700
3              4   Human Resources        2400
4              5          Shipping        1500
5              6                IT        1400
6              7  Public Relations        2700
7              8             Sales        2500
8              9         Executive        1700
9             10           Finance        1700
10            11        Accounting        1700

In [31]:
cur.execute("SELECT * from employees")
employees_data = pd.DataFrame(cur.fetchall())
employees_data.columns = [x[0] for x in cur.description]
employees_data

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,100,Steven,King,steven.king@sqltutorial.org,515.123.4567,1987-06-17,4,24000,None,9
1,101,Neena,Kochhar,neena.kochhar@sqltutorial.org,515.123.4568,1989-09-21,5,17000,100,9
2,102,Lex,De Haan,lex.de haan@sqltutorial.org,515.123.4569,1993-01-13,5,17000,100,9
3,103,Alexander,Hunold,alexander.hunold@sqltutorial.org,590.423.4567,1990-01-03,9,9000,102,6
4,104,Bruce,Ernst,bruce.ernst@sqltutorial.org,590.423.4568,1991-05-21,9,6000,103,6
5,105,David,Austin,david.austin@sqltutorial.org,590.423.4569,1997-06-25,9,4800,103,6
6,106,Valli,Pataballa,valli.pataballa@sqltutorial.org,590.423.4560,1998-02-05,9,4800,103,6
7,107,Diana,Lorentz,diana.lorentz@sqltutorial.org,590.423.5567,1999-02-07,9,4200,103,6
8,108,Nancy,Greenberg,nancy.greenberg@sqltutorial.org,515.124.4569,1994-08-17,7,12000,101,10
9,109,Daniel,Faviet,daniel.faviet@sqltutorial.org,515.124.4169,1994-08-16,6,9000,108,10
10,110,John,Chen,john.chen@sqltutorial.org,515.124.4269,1997-09-28,6,8200,108,10
11,111,Ismael,Sciarra,ismael.sciarra@sqltutorial.org,515.124.4369,1997-09-30,6,7700,108,10
12,112,Jose Manuel,Urman,jose manuel.urman@sqltutorial.org,515.124.4469,1998-03-07,6,7800,108,10
13,113,Luis,Popp,luis.popp@sqltutorial.org,515.124.4567,1999-12-07,6,6900,108,10
14,114,Den,Raphaely,den.raphaely@sqltutorial.org,515.127.4561,1994-12-07,14,11000,100,3
15,115,Alexander,Khoo,alexander.khoo@sqltutorial.org,515.127.4562,1995-05-18,13,3100,114,3
16,116,Shelli,Baida,shelli.baida@sqltutorial.org,515.127.4563,1997-12-24,13,2900,114,3
17,117,Sigal,Tobias,sigal.tobias@sqltutorial.org,515.127.4564,1997-07-24,13,2800,114,3
18,118,Guy,Himuro,guy.himuro@sqltutorial.org,515.127.4565,1998-11-15,13,2600,114,3
19,119,Karen,Colmenares,karen.colmenares@sqltutorial.org,515.127.4566,1999-08-10,13,2500,114,3
20,120,Matthew,Weiss,matthew.weiss@sqltutorial.org,650.123.1234,1996-07-18,19,8000,100,5
21,121,Adam,Fripp,adam.fripp@sqltutorial.org,650.123.2234,1997-04-10,19,8200,100,5
22,122,Payam,Kaufling,payam.kaufling@sqltutorial.org,650.123.3234,1995-05-01,19,7900,100,5
23,123,Shanta,Vollman,shanta.vollman@sqltutorial.org,650.123.4234,1997-10-10,19,6500,100,5
24,126,Irene,Mikkilineni,irene.mikkilineni@sqltutorial.org,650.124.1224,1998-09-28,18,2700,120,5
25,145,John,Russell,john.russell@sqltutorial.org,None,1996-10-01,15,14000,100,8
26,146,Karen,Partners,karen.partners@sqltutorial.org,None,1997-01-05,15,13500,100,8
27,176,Jonathon,Taylor,jonathon.taylor@sqltutorial.org,None,1998-03-24,16,8600,100,8
28,177,Jack,Livingston,jack.livingston@sqltutorial.org,None,1998-04-23,16,8400,100,8
29,178,Kimberely,Grant,kimberely.grant@sqltutorial.org,None,1999-05-24,16,7000,100,8
30,179,Charles,Johnson,charles.johnson@sqltutorial.org,None,2000-01-04,16,6200,100,8
31,192,Sarah,Bell,sarah.bell@sqltutorial.org,650.501.1876,1996-02-04,17,4000,123,5
32,193,Britney,Everett,britney.everett@sqltutorial.org,650.501.2876,1997-03-03,17,3900,123,5
33,200,Jennifer,Whalen,jennifer.whalen@sqltutorial.org,515.123.4444,1987-09-17,3,4400,101,1
34,201,Michael,Hartstein,michael.hartstein@sqltutorial.org,515.123.5555,1996-02-17,10,13000,100,2
35,202,Pat,Fay,pat.fay@sqltutorial.org,603.123.6666,1997-08-17,11,6000,201,2
36,203,Susan,Mavris,susan.mavris@sqltutorial.org,515.123.7777,1994-06-07,8,6500,101,4
37,204,Hermann,Baer,hermann.baer@sqltutorial.org,515.123.8888,1994-06-07,12,10000,101,7
38,205,Shelley,Higgins,shelley.higgins@sqltutorial.org,515.123.8080,1994-06-07,2,12000,101,11
39,206,William,Gietz,william.gietz@sqltutorial.org,515.123.8181,1994-06-07,1,8300,205,11

# SQL test queries (part 1)

In [32]:
cur.execute("""
            SELECT * 
            FROM employees
            WHERE manager_id = 100
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,101,Neena,Kochhar,neena.kochhar@sqltutorial.org,515.123.4568,1989-09-21,5,17000,100,9
1,102,Lex,De Haan,lex.de haan@sqltutorial.org,515.123.4569,1993-01-13,5,17000,100,9
2,114,Den,Raphaely,den.raphaely@sqltutorial.org,515.127.4561,1994-12-07,14,11000,100,3
3,120,Matthew,Weiss,matthew.weiss@sqltutorial.org,650.123.1234,1996-07-18,19,8000,100,5
4,121,Adam,Fripp,adam.fripp@sqltutorial.org,650.123.2234,1997-04-10,19,8200,100,5
5,122,Payam,Kaufling,payam.kaufling@sqltutorial.org,650.123.3234,1995-05-01,19,7900,100,5
6,123,Shanta,Vollman,shanta.vollman@sqltutorial.org,650.123.4234,1997-10-10,19,6500,100,5
7,145,John,Russell,john.russell@sqltutorial.org,None,1996-10-01,15,14000,100,8
8,146,Karen,Partners,karen.partners@sqltutorial.org,None,1997-01-05,15,13500,100,8
9,176,Jonathon,Taylor,jonathon.taylor@sqltutorial.org,None,1998-03-24,16,8600,100,8
10,177,Jack,Livingston,jack.livingston@sqltutorial.org,None,1998-04-23,16,8400,100,8
11,178,Kimberely,Grant,kimberely.grant@sqltutorial.org,None,1999-05-24,16,7000,100,8
12,179,Charles,Johnson,charles.johnson@sqltutorial.org,None,2000-01-04,16,6200,100,8
13,201,Michael,Hartstein,michael.hartstein@sqltutorial.org,515.123.5555,1996-02-17,10,13000,100,2

In [33]:
cur.execute("""
            SELECT * 
            FROM employees
            WHERE manager_id = 100 AND department_id IN (5,9)
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,101,Neena,Kochhar,neena.kochhar@sqltutorial.org,515.123.4568,1989-09-21,5,17000,100,9
1,102,Lex,De Haan,lex.de haan@sqltutorial.org,515.123.4569,1993-01-13,5,17000,100,9
2,120,Matthew,Weiss,matthew.weiss@sqltutorial.org,650.123.1234,1996-07-18,19,8000,100,5
3,121,Adam,Fripp,adam.fripp@sqltutorial.org,650.123.2234,1997-04-10,19,8200,100,5
4,122,Payam,Kaufling,payam.kaufling@sqltutorial.org,650.123.3234,1995-05-01,19,7900,100,5
5,123,Shanta,Vollman,shanta.vollman@sqltutorial.org,650.123.4234,1997-10-10,19,6500,100,5

In [36]:
cur.execute("""
            SELECT * 
            FROM employees
            WHERE manager_id = 100 AND (department_id IN (5,9) OR salary >10000)
            ORDER BY salary DESC
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,101,Neena,Kochhar,neena.kochhar@sqltutorial.org,515.123.4568,1989-09-21,5,17000,100,9
1,102,Lex,De Haan,lex.de haan@sqltutorial.org,515.123.4569,1993-01-13,5,17000,100,9
2,145,John,Russell,john.russell@sqltutorial.org,None,1996-10-01,15,14000,100,8
3,146,Karen,Partners,karen.partners@sqltutorial.org,None,1997-01-05,15,13500,100,8
4,201,Michael,Hartstein,michael.hartstein@sqltutorial.org,515.123.5555,1996-02-17,10,13000,100,2
5,114,Den,Raphaely,den.raphaely@sqltutorial.org,515.127.4561,1994-12-07,14,11000,100,3
6,121,Adam,Fripp,adam.fripp@sqltutorial.org,650.123.2234,1997-04-10,19,8200,100,5
7,120,Matthew,Weiss,matthew.weiss@sqltutorial.org,650.123.1234,1996-07-18,19,8000,100,5
8,122,Payam,Kaufling,payam.kaufling@sqltutorial.org,650.123.3234,1995-05-01,19,7900,100,5
9,123,Shanta,Vollman,shanta.vollman@sqltutorial.org,650.123.4234,1997-10-10,19,6500,100,5

In [39]:
cur.execute("""
            SELECT DISTINCT first_name
            FROM employees
            """)
test_data = pd.DataFrame(cur.fetchall())
test_data.columns = [x[0] for x in cur.description]
test_data

     first_name
0        Steven
1         Neena
2           Lex
3     Alexander
4         Bruce
5         David
6         Valli
7         Diana
8         Nancy
9        Daniel
10         John
11       Ismael
12  Jose Manuel
13         Luis
14          Den
15       Shelli
16        Sigal
17          Guy
18        Karen
19      Matthew
20         Adam
21        Payam
22       Shanta
23        Irene
24     Jonathon
25         Jack
26    Kimberely
27      Charles
28        Sarah
29      Britney
30     Jennifer
31      Michael
32          Pat
33        Susan
34      Hermann
35      Shelley
36      William